Repository: JTi65/budgie-desktop-fi
Catalog: for_translation_budgie-welcome_gettingstarted_*.po
Languages: fi

source: Improve power management, particularly if the device experiences overheating problems under open source drivers.
fi: Parantaakseenvirrankäyttöä,varsinkinjoslaitteessailmeneeylikuumenemisongelmiaavoimenkoodinajureidenollessakäytössä.

source: Improve support for high resolutions and multiple monitors.
fi: Parantaakseenkorkeidennäyttötarkkuuksientukeasekätukeamonellenäytölle.

source: Fix blank screen issues.
fi: Mustanäyttöongelmienkorjaamiseksi.

source: Proprietary drivers are known as "binary blobs". Certain hardware may experience adverse behavior, causing more issues than the open source drivers, such as:
fi: Omisteisetajurittunnetaankäsitteellä"binaryblobs-binääriläiskät".Tiettyjenlaitteidenkohdallavoiilmetäodottamatontatoimintaa,aiheuttaenenemmänongelmiakuinavointenajurienkanssa,kuten:

source: Failing to boot to the graphical desktop.
fi: Tietokoneenkäynnistymättömyysgraafiseentyöpöytäänasti.

source: Broken drivers after an upgrade.
fi: Päivityksenjälkeisiäajuririkkonaisuuksia.

source: Severe graphical glitches.
fi: Vakaviagraafisiahäiriöitä.

source: Problems with applications/games requiring hardware acceleration.
fi: Toimimattomuuttasovellusten/peliensuhteenjotkavaativatlaitteistokiihdytystä.

source: <code id="graphics-open-driver-name"></code> is the open source driver for your card.
fi: <codeid="graphics-open-driver-name"></code>onavoimenkoodinajurinäytönohjainkortillesi.

source: What about the latest NVIDIA drivers?
fi: EntäpäviimeisimmätNVIDIA-ajurit?

source: <b>Additional Drivers</b> fetches the latest tested driver from the Ubuntu repositories. Advanced users and gamers who would like newer versions may wish to consider adding the <a onclick="cmd('link?https://launchpad.net/~graphics-drivers/+archive/ubuntu/ppa')">Ubuntu Graphics Driver PPA</a>, which packages up the latest NVIDIA drivers for Ubuntu. These packages are not as thoroughly tested.
fi: <b>Lisäajurit</b>noutaaviimeisimmäntestatunajurinUbuntu:nohjelmalähteistä.Edistyneetkäyttäjätsekäpelaajatjotkahaluavatuudempiaversioitasaattavatharkita<aonclick="cmd('link?https://launchpad.net/~graphics-drivers/+archive/ubuntu/ppa')">Ubuntu:ngarfiikka-ajureidenPPA:n</a>lisäämistä,johonpakataanvalmiiksiviimeisimmätNVIDIA-ajuritUbuntu:lle.Näidenpakettiensuhteeneioletehtyläpikotaistatestausta.

source: This only applies for actively supported cards, and not older cards using the legacy driver.
fi: Tämäpäteevainaktiivisestituettuihinkortteihin,eivanhempiinkortteihinjoidenkäyttövaatiivanhanaikaisenlegacy-ajurin.

source: Add Repository
fi: Lisääohjelmavarasto

source: After the PPA is added, newer versions are presented to install in <a onclick="cmd('drivers')">Additional Drivers:</a>
fi: SenjälkeenkunPPAonlisätty,uudemmatversiotilmestyvätnäkyviinasennettavaksi<aonclick="cmd('drivers')">Lisäajurit</a>valikossa

source: Wireless, Bluetooth and Other Devices
fi: Langatonverkko,Bluetoothjamuutlaitteet

source: If there were no additional drivers found for the hardware nor did it work after installing the firmware packages, you may need to research your device to find the appropriate driver.
fi: Mikälilaitteidenlisäajureitaeihavaittutaineeivätfirmware-laiteajuripakettienasennuksenjälkeentoimineet,sinunpitääluultavastietsiälisäätietoalaitteestasilöytääksesisopivanajurin.

source: Unfortunately, this is due to the fact the manufacturer for your hardware hasn't provided any source code for developers to freely use, or there is insufficient documentation to create drivers for your particular brand and model.
fi: Valitettavasti,tämäjohtuusiitätosiasiastaettälaitteesivalmistajaeioletoimittanutkehittäjilleminkäänlaistavapaatalähdekoodiajotavoisikäyttää,taisittenselontekoonriittämättömänvaillinaistajottaajuritvoitaisiinluodajuurisinunlaitteesikyseisellemerkilletaimallille.

source: Some manufacturers may provide closed source drivers provided by themselves directly. If you require assistance, feel free to <a onclick="smoothPageFade('community.html')">ask the community</a>.
fi: Jotkutvalmistajatsaattavattoimittaasuljetunlähdekoodinajuritjotkahetoimittavatsuoraanitse.Mikälitarvitsettukea,äläepäröi<aonclick="smoothPageFade('community.html')">kysyäyhteisöltä</a>.

source: Read more on troubleshooting wireless hardware.
fi: Luelisäälangattomanlaitteistonongelmanratkaisusta.

source: Language Input
fi: Kieli

source: Input method
fi: Syöttötapa

source: In Ubuntu Budgie, we provide an option to switch between two widely used keyboard entry layouts. IBus(Intelligent Input Bus) and Fcitx(Free Chinese Input Toy for X).
fi: Ubuntu Budgie -palvelussa tarjoamme mahdollisuuden vaihtaa kahden laajasti käytetyn näppäimistön sisäänkäynnin asettelun välillä. IBUS (älykäs syöttöväylä) ja FCITX (ilmainen kiinalainen syöttölelu x: lle).

source: Install & Configure IBus
fi: Asenna&mukautaIBus

source: IBus is active now
fi: IBusonnyttoiminnassa

source: Install & Configure Fcitx
fi: Asenna&mukautaFcitx

source: Fcitx is active now
fi: Fcitxonnyttoiminnassa

source: Language Support
fi: Kielituki

source: Your computer may require updates to your language and localization settings, or you may want to install additional language support.
fi: Tietokoneeseesitarvitaanluultavastipäivityksiäkieli-jakotoistusasetuksiisi,taisittenvoithalutaasentaalisäkielituen.

source: <b>Language Support</b> can be found later in the menu <b>System Tools</b>
fi: <b> Kielituki </b> löytyy myöhemmin valikosta <b> järjestelmätyökalut </b>

source: Complex Input
fi: Monimutkainensyöte

source: Some regions of the world require complex inputs.
fi: Jotkutmaailmanalueetvaativatmonimutkaisemmansyötemallin.

source: Chinese
fi: Kiina

source: Japanese
fi: Japani

source: Korean
fi: Korea

source: Flatpak, Dropbox and User Management
fi: Flatpak, Dropbox ja käyttäjän hallinta

source: <strong>Flatpak</strong> is a new generation application distribution framework. It introduces a unified packaging format across various GNU/Linux distributions. Please note that Flatpak applications are not part of the core Ubuntu experience.
fi: <strong> Flatpak </strong> on uuden sukupolven sovellusjakelukehys. Se esittelee yhtenäisen pakkausmuodon erilaisissa GNU/Linux -jakaumissa. Huomaa, että Flatpak -sovellukset eivät ole osa Ubuntu -ydinkokemusta.

source: Learn more
fi: Opilisää

source: Install & Configure Flatpak
fi: Asenna&määritäFlatpak

source: Flatpak is installed.
fi: Flatpak on asennettu.

source: Please reboot for the service to start.
fi: Käynnistä palvelu uudelleen.

source: Being a user friendly distribution, Ubuntu Budgie allows you to install Flatpak with a single click. After setup, you can use <strong>Software</strong> to install Flatpak applications.
fi: Ubuntu Budgie on käyttäjäystävällinen jakelu, jonka avulla voit asentaa Flatpakin yhdellä napsautuksella. Asennuksen jälkeen voit käyttää <strong> -ohjelmistoa </strong> FlatPak -sovellusten asentamiseen.

source: <strong>Dropbox</strong> is a popular proprietary file sharing and storage solution.
fi: <strong>Dropbox</strong>onsuosittuomisteinentiedostonjakojavarastointiratkaisu.

source: Install & Configure Dropbox
fi: AsennajamääritäDropbox

source: Dropbox is installed.
fi: Dropbox on asennettu.

source: After installing, logout and login and follow the dropbox instructions that are then displayed.
fi: Asennuksenjälkeen,kirjauduulosjatakaisinsisäänsekäseuraanäkyvilletuleviaDropbox:inohjeita.

source: Users
fi: Käyttäjät

source: Share your computer with others? Set up a separate user account for each user to protect the individual privacy of each user sharing the same computer.
fi: Jaatkotietokoneesimuidenkanssa?Teeerillisetkäyttäjätilitjokaisellekäyttäjälleturvataksesihenkilökohtaisenyksityisyydensuojanjokaisellekäyttäjällejokajakaatietokoneesi.

source: You can also log in to a <b>Guest Session</b> if someone is using your computer as a one-off.
fi: Voitmyössisäänkirjautua<b>Vierasistunnolle</b>mikälijokukäyttäätietokonettasikertaluontoisesti.

source: Configure Users
fi: Määritäkäyttäjät

source: <b>Users</b> can be found later in the menu by typing<i> Users</i></b>.
fi: <b> käyttäjät </b> löytyy myöhemmin valikosta kirjoittamalla <i> käyttäjät </i> </b>.

source: To improve the amount of customizability, Ubuntu Budgie allows you to install/remove popular web browsers.
fi: Mukautettavuuden määrän parantamiseksi Ubuntu Budgie antaa sinun asentaa/poistaa suosittuja verkkoselaimia.

source: Mozilla Firefox is a free and open-source web browser, developed by the Mozilla Foundation - a not for profit organization. It is highly popular targeting multiple platforms.
fi: MozillaFirefoxonvapaajalähdekoodiltaanavoininternet-selainjotakehittääsäätiöMozillaFoundation-voittoatavoittelematonyhdistys.Seonerittäinsuosittumonillaalustoilla,joihinsetähtääkin.

source: Snap Install
fi: Snap-asennus

source: Snap Remove
fi: Snap-poisto

source: Mozilla Firefox is a free and open-source web browser, developed by the Mozilla Foundation - a not for profit organization. This is the Extended Support Release browser for comprehensive data security and data protection.
fi: MozillaFirefoxonvapaajalähdekoodiltaanavoininternet-selainjotakehittääsäätiöMozillaFoundation-voittoatavoittelematonyhdistys.TämäESR-julkaisutarkoittaapidennetyntuenmallia(ExtendedSupportRelease)jossaominaisuutenakattavatietoturvajasuoja.

source: Mozilla Firefox is a free and open-source web browser, developed by the Mozilla Foundation - a not for profit organization. This is the stable release browser made available directly by Mozilla thru their own repository.
fi: Mozilla Firefox on ilmainen ja avoimen lähdekoodin selain, jonka on kehittänyt Mozilla Foundation - ei voittoa tavoittelija. Tämä on vakaa julkaisuselain, jonka Mozilla on saatavana suoraan oman arkistonsa kautta.

source: Click Remove first to uninstall the current firefox package, followed by Install to add the Mozilla repository and package.
fi: Napsauta Irrota ensin poistaaksesi nykyisen Firefox -paketin, jonka jälkeen asenna lisää Mozilla -arkisto ja paketti.

source: Chromium is an open-source browser project that aims to build a safer, faster, and more stable way for all Internet users to experience the web.
fi: Chromiumonavoimenohjelmistokoodinselainhankejokatähtääturvallisempaan,nopeampaanjavakaampaanverkkokokemukseenkaikilleinternet:inkäyttäjille.

source: Google Chrome is a modern web browser backed by internet giant Google. It offers a smooth browsing experience plus integration with Google's proprietary services.
fi: GoogleChromeonnykyaikaineninternet-selainjonkataustavoimanaoninternet:injättiläinenGoogle.SetarjoaasulavanverkkoselauskokemuksensekäyhtenevyydenGoogle:nomisteistenpalvelujenkanssa.

source: Downloads Page
fi: Lataussivu

source: Microsoft Edge is a cross-platform web browser created and developed by Microsoft. It is a Chromium based browser.
fi: MicrosoftEdgeoninternet-selianmonellealustalle.SenontehnytMicrosoftjamyöskehittääsitä.SeonChromium-pohjainenselain.

source: Vivaldi Web Browser is a free, fully customizable web browser. Feature rich, powerful, secure and fun! Browse the Web your way
fi: VivaldiWebBrowseronvapaa,kokonaisvaltaisestimuokattavaissaolevainternet-selain.Ominaisuuksiltaanrikas,tehokas,turvallinenjahauska!Selaaverkkoaomallatavallasi

source: Opera is a fast and secure browser. Developed in Europe, used by millions around the world. Now with a built-in ad blocker and free VPN.
fi: Operaonnopeajaturvallinenselain.Euroopassakehitetty,miljoonienkäyttämäympärimaailmaa.MukanaonnytsisäänrakennettumainostenestojailmainenVPN.

source: A browser that blocks tracking and intrusive ads by default.
fi: Selainjokaestääseurannansekätunkeilevatmainoksetvakiollisesti.

source: Midori is a lightweight yet powerful web browser which runs just as well on little embedded computers named for delicious pastries as it does on beefy machines with a core temperature exceeding that of planet earth. And it looks good doing that, too. Oh, and of course it's free software.
fi: Midorionkevytmuttatehokasinternet-selainjokapyöriiyhtähyvinpienissäsulautetuissatietokoneissakuinsuupalanakutenmyösmuskelimyllyissäjoidenydinlämpötilaylittääMaanvastaavan.Jasetekeeasiansamyösnäyttävästi.Niin,jatietenkinseonosavapaitaohjelmistoja.

source: The web browser for GNOME, featuring tight integration with the desktop and a simple and intuitive user interface that allows you to focus on your web pages. If you’re looking for a simple, clean, beautiful view of the web, this is the browser for you. GNOME Web is often referred to by its code name, Epiphany.
fi: Internet-selainGNOME:lle,ominaisuuksiinkuuluutyöpöytäsulautussekähelppojaintuitiivinenkäyttöliittymäjokaantaasinunkeskittyäverkkosivuihisi.Josetsityksinkertaista,selkeää,kaunistaverkkonäkymää,tämäonsinunselaimesi.GNOMEWebtuleeuseinviitatuksikoodinimensäjohdostamuodossaEpiphany.

source: User Interface
fi: Käyttöliittymä

source: Ubuntu Budgie provides a unique tool to transform the user interface. It can be used to quickly setup the user interface to broadly reflect how other popular operating systems look and feel.
fi: Ubuntu Budgie tarjoaa ainutlaatuisen työkalun käyttöliittymän muuttamiseen. Sitä voidaan käyttää käyttöliittymän nopeasti asentamiseen heijastamaan laajasti sitä, kuinka muut suositut käyttöjärjestelmät näyttävät ja tunteet.

source: Budgie Desktop Settings
fi: Budgie-työpöydänAsetukset

source: <b>Budgie Desktop Settings</b> can be found later in the menu <b>System Tools</b>.
fi: <b>Budgie-työpöydänasetukset</b>löytyvätmyöhemminvalikossapaikasta<b>Järjestelmätyökalut</b>.

source: Budgie Control Center
fi: Budgienhallintakeskus

source: You can configure just about every aspect of your computer from Budgie Control Center.
fi: VoitnytmäärittäälähesjokaisentietokoneesiyksityiskohdanBudgienhallintakeskuksesta.

source: <b>Budgie Control Center</b> can be found later in the menu <b>System Tools</b>.
fi: <b>Budgienhallintakeskus</b>löytyymyöhemminvalikosta<b>Järjestelmätyökalut</b>.

source: Ubuntu Budgie has many keyboard shortcuts that help make using your computer more efficient.
fi: Ubuntu Budgie on monia pikanäppäimiä, jotka auttavat tekemään tietokoneesi käytöstä tehokkaampaa.

source: The <b><img src="img/welcome/super-key.svg" /> Super</b> key is your Windows key. For Mac keyboards, this is the ⌘ Command key.
fi: <b><imgsrc="img/welcome/super-key.svg"/>Super</b>näppäimeksinimitettynäppäinonmahdollinenWindows-näppäin.Mac-näppäimistöille,samanasianajaa⌘käskynäppäin.

source: Budgie Desktop shortcuts
fi: Budgie-työpöydänoikopolut

source: Some common shortcuts used in Budgie Desktop
fi: JoitakinyleisestikäytettyjäBudgie-työpöydänoikopolkuja

source: Open notifications in Raven
fi: AvaailmoituksetRaven:issa

source: Open applet Settings in Raven
fi: AvaasovellutusAsetuksetRaven:issa

source: Common application shortcuts
fi: Yleisiäsovellusoikopolkuja

source: These shortcuts apply in most applications.
fi: Nämäoikopoluttoimivatuseimmissasovelluksissa.

source: Toggle Tilix Quake Mode
fi: VaihdaTilixQuake-tila

source: Copy the selected text/object
fi: Kopioivalittuteksti/kohde

source: Cut the selected text/object
fi: Leikkaavalittuteksti/kohde

source: Paste/insert the selected text/object
fi: Liimaa/asetavalittuteksti/kohde

source: Select all text
fi: Valitsekaikkiteksti

source: Find words
fi: Etsisanoja

source: Find and replace words
fi: Etsijakorvaasanoja

source: Make the selected text bold
fi: Lihavoivalittuteksti

source: Make the selected text italic
fi: Kursivoivalittuteksti

source: Underline the selected text
fi: Alleviivaavalittuteksti

source: Open a new document or window
fi: Avaauusiasiakirjataiikkuna

source: Save the current document
fi: Tallennanykyinenasiakirja

source: Open another document
fi: Avaatoinenasiakirja

source: Print the current document
fi: Tulostanykyinenasiakirja

source: Undo the last change you made
fi: Kumoaviimeksitekemäsimuutos

source: Shift
fi: Shift-vaihtonäppäin

source: Redo a change that you just undid
fi: Uudelleentuomuutosjonkajuurikumosit

source: Toggle the current application between full-screen and windowed
fi: Vaihtelenykyisensovelluksenkokoruutu-taiikkunatilaa

source: Desktop shortcuts
fi: Työpöydänoikopolut

source: This section lists common keyboard shortcuts which you can use to operate parts of the desktop.
fi: Tämäosa-alueluetteloiyleisetnäppäinoikopolutjoitavoitkäyttäätyöpöytäsiosienohjaamiseen.

source: Open Applications menu
fi: Avaasovellusvalikko

source: Copy a screenshot of an area to clipboard
fi: Kopioitietynalueenkuvakaappausleikepöydälle

source: Save a screenshot of an area to the Pictures directory
fi: TallennakuvakaappaustietyltäalueeltaKuvat-kansioon

source: Copy a screenshot of a window to clipboard
fi: Kopioikuvakaappausikkunastaleikepöydälle

source: Alt
fi: Alt-näppäin

source: Save a screenshot of a window to the Pictures directory
fi: TallennakuvakaappausikkunastaKuvat-kansioon

source: Save a screenshot to the Pictures directory
fi: TallennakuvakaappausKuvat-kansioon

source: Run an application by typing its name in the box which appears
fi: Ajasovellussyöttäenilmestyväänlaatikkoonsennimi

source: Delete
fi: Poista

source: Logout
fi: Uloskirjaus

source: Lock your screen.
fi: Lukitseruutu.

source: Open a terminal.
fi: Avaapääte.

source: Window shortcuts - general
fi: Ikkunaoikopolut-yleiset

source: Call Window Shuffler gui (window tiling grid).
fi: KutsuWindowShuffler-ikkunasatunnaistajangraafinenkäyttöliittymä(ikkunalomituksenritilöinti).

source: Video Demonstration
fi: Video-esitelmä

source: Tab
fi: Tab-näppäin

source: Switch between currently-open windows.
fi: Vaihteletällähetkelläavoinnaolevienikkunoidenvälillä.

source: Press Alt + Tab and then release Tab (but continue to hold Alt).
fi: PainaalasAlt+TabjonkajälkeenvapautaTab(muttajatkaAlt-näppäimenalaspainamista).

source: Press Tab repeatedly to cycle through the list of available windows which appears on the screen.
fi: PainaTab-näppäintäjatkuvastikierrättääksesitarjollaoleviaavoimiaikkunoitajotkailmenevätruudulla.

source: Left
fi: Vasen-nuolinäppäin

source: Switch to the previous workspace.
fi: Vaihdaedelliseentyötilaan.

source: Right
fi: Oikea-nuolinäppäin

source: Switch to the next workspace.
fi: Vaihdaseuraavaantyötilaan.

source: Move the current window to the previous workspace.
fi: Siirränykyinenikkunaedelliseentyötilaan.

source: Move the current window to the next workspace.
fi: Siirränykyinenikkunaseuraavaantyötilaan.

source: Move the current window to the monitor above.
fi: Siirränykyinenikkunaylläolevaannäyttöön.

source: Move the current window to the monitor below.
fi: Siirränykyinenikkunaallaolevaannäyttöön.

source: Move the current window to the monitor to the left.
fi: Siirränykyinenikkunavasemmanpuoleiseennäyttöön.

source: Move the current window to the monitor to the right.
fi: Siirränykyinenikkunaoikeanpuoleiseennäyttöön.

source: Closes window.
fi: Sulkeeikkunan.

source: Returns window to 'normal' or previous size.
fi: Palauttaaikkunan'tavalliseksi'taiedelliseenkokoon.

source: Moves the current window (can be moved with mouse or keyboard).
fi: Siirtäänykyisenikkunan(voidaanliikuttaahiirellätainäppäimistöllä).

source: Resizes current window (again, can be moved with mouse or keyboard).
fi: Muuttanykyisenikkunankokoa(taas,voidaanliikuttaahiirellätainäppäimistöllä).

source: Minimizes current window.
fi: Pienentäänykyisenikkunan.

source: Up
fi: Ylös-nuolinäppäin

source: Maximizes current window.
fi: Suurentaanykyisenikkunan.

source: Down
fi: Alas-nuolinäppäin

source: Unmaximizes current window.
fi: Poissuurentaanykyisenikkunan.

source: Space
fi: Välilyönti

source: Displays the window menu with options such as 'Always on Top' and 'Minimize' and 'Maximize' and above commands.
fi: Näyttääikkunavalikonjoissanäkyyvaihtoehtojakuten'Ainapäällimmäisenä'ja'Pienennä'sekä'Suurenna'kutenmyösylläolevatkäskyt.

source: Place window on left side of screen.
fi: Asetaikkunaruudunvasemmallepuolelle.

source: Place window on right side of screen.
fi: Asetaikkunaruudunoikeallepuolelle.

source: Quarter tiling: top left.
fi: Sälytysneljännekseen:vasemmalleylös.

source: Quarter tiling: top right.
fi: Sälytysneljännekseen:oikealleylös.

source: Quarter tiling: bottom left.
fi: Sälytysneljännekseen:alasvasemmalle.

source: Quarter tiling: bottom right.
fi: Sälytysneljännekseen:alasoikealle.

source: Window shortcuts - numeric keypad
fi: Ikkunaoikopolut-numeronäppäimistö

source: Tiling shortcuts on the numeric keypad.
fi: Sälytyksenoikopolutnumeronäppäimistössä.

source: Quarter top left.
fi: Neljännesvasemmalleylös.

source: Quarter top right.
fi: Neljännesoikealleylös.

source: Quarter bottom right.
fi: Neljännesoikeallealas.

source: Quarter bottom left.
fi: Neljännesvasemmallealas.

source: Half top.
fi: Yläosanpuolisko.

source: Half right.
fi: Oikeanpuoleinenpuolisko.

source: Half bottom.
fi: Alaosanpuolisko.

source: Half left.
fi: Vasemmanpuoleinenpuolisko.

source: Toggle maximize.
fi: Suurentamisenvaihtelu.

source: Update shortcuts in the Settings App
fi: PäivitäoikopolutAsetukset-sovelluksessa

source: Your machine is made up of various components that interact with one another. This information is useful when providing support to ensure hardware and software works on your machine.
fi: Tietokoneesikoostuuuseistaosasistajotkakeskustelevatkeskenään.Tämätietoonhyödyllistäantaessatukealaitteistonjaohjelmistonvälisentoimivuudenvarmistamistavartentietokoneessasi.

source: Gathering Information..
fi: Kerätääntietoa..

source: System
fi: Järjestelmä

source: Distribution:
fi: Jakelu:

source: Kernel:
fi: Ydin:

source: The Linux kernel is the heart of Ubuntu.
fi: Linux-ydinonUbuntu:nsydän.

source: Motherboard:
fi: Emolevy:

source: Boot Mode:
fi: Käynnistysmoodi:

source: Displays the mode that OS is communicating with the firmware.
fi: Ilmaiseetilanjollakäyttöjärjestelmäkeskusteleefirmware-laiteajurinkanssa.

source: Processor
fi: Suoritin

source: Model:
fi: Malli:

source: Speed:
fi: Nopeus:

source: Architecture in use:
fi: Käytössäolevaarkkitehtuuri:

source: The operating system's architecture in use. For instance, i386 = 32-bit.
fi: Käyttöjärjestelmänkäyttämäarkkitehtuuri.Esimerkiksi,i386=32-bit.

source: Components
fi: Osat

source: Memory (RAM):
fi: Muisti(RAM-keskusmuisti):

source: More RAM allows more applications to run simultaneously.
fi: MitäenemmänRAM-keskusmuistia,sitäenemmänsovelluksiavoidaanajaasamanaikaisesti.

source: Graphics:
fi: Grafiikka:

source: Internet Access:
fi: Internet-yhteys:

source: Connected
fi: Yhdistetty

source: Not Connected
fi: Eiyhdistetty

source: Storage
fi: Levytila

source: Root File System:
fi: Root-juuri-tiedostojärjestelmä:

source: The file system where OS is installed.
fi: Tiedostojärjestelmäjohonkäyttöjärjestelmäonasennettu.

source: Entire Disk Capacity:
fi: Levytilakokonaisuudessaan:

source: OS Usage
fi: Käyttöjärjestelmänkäyttämätila

source: Other Usage
fi: Muukäyttö

source: Allocated for Ubuntu Budgie:
fi: Osoitettu Ubuntu Budgie:

source: The size of your operating system partition.
fi: Käyttöjärjestelmäosiosikoko.

source: Used Space:
fi: Käytettytila:

source: Free Space:
fi: Vapaatatilaa:

source: Other Usage:
fi: Muukäyttö:

source: Reserved by system, other partitions, unallocated or swap.
fi: Järjestelmänvaraama,muutosiot,varaamattomattaiswap-heittovaihto-osio.
