Repository: JTi65/budgie-desktop-fi
Catalog: for_translation_budgie-welcome_gettingstarted_*.po
Languages: fi

source: Getting Started
fi: Alkuunpääsy

source: Prerequisites
fi: Ennakkotoimenpiteet

source: System Requirements
fi: Laitevaatimukset

source: Installation Preparation
fi: Asennuksenvalmistelu

source: Dual Booting
fi: Kaksoiskäynnistys

source: Install Now
fi: Asennaheti

source: Familiarity
fi: Tututjutut

source: Browser Ballot
fi: Selaintarjonta

source: Customization
fi: Muokattavuus

source: Keyboard Shortcuts
fi: Näppäimistö-oikopolut

source: Post-Installation
fi: Jälkiasennus

source: Updates & Extras
fi: Päivitykset&lisät

source: Drivers
fi: Ajurit

source: Language & Input
fi: Kieli&syöttöasetukset

source: Optional Tasks
fi: Vaihtoehtoisettehtävät

source: Troubleshooting
fi: Pulmanratkaisu

source: System Specifications
fi: Järjestelmämääritykset

source: Please choose a topic to get started.
fi: Valitseaihealoittaaksesi.

source: Modest System Requirements
fi: Vaatimattomatjärjestelmävaatimukset

source: Ubuntu Budgie works well on both high-end to older computers, optimized to be functional, while light on system resources.
fi: Ubuntu Budgie toimii hyvin molemmilla huippuluokan vanhemmilla tietokoneilla, jotka on optimoitu toiminnalliseksi, kun taas järjestelmän resurssit valaisevat.

source: Minimum
fi: Vähimmäinen

source: Pentium i3 - approximately created in 2013
fi: Pentiumi3-tuotiinmarkkinoillekarkeastivuonna2013

source: 2 gigabytes (GB) of RAM
fi: 2gigatavua(Gt)keskusmuistia(RAM)

source: 32 gigabytes (GB) of disk space
fi: 32 Gigatavua (GB) levytilasta

source: 32 gigabytes (GB) SD Card
fi: 32 Gigatavua (GB) SD -kortti

source: Recommended
fi: Suositus

source: Pentium i5 - approximately created in 2017
fi: Pentium i5 - luotu suunnilleen vuonna 2017

source: 4 gigabytes (GB) of RAM
fi: 4gigatavuakeskusmuistia

source: 60 gigabytes (GB) of disk space
fi: 60 gigatavua (GB) levytilasta

source: 60 gigabytes (GB) SSD
fi: 60 gigatavua (GB) SSD

source: The operating system will run much more efficiently if your computer meets or surpasses the recommended requirements.
fi: Käyttöjärjestelmätoimiisulavamminjostietokoneesivastaataiylittääsuositellutvaatimukset.

source: What's inside my computer?
fi: Mitätietokoneenisisältää?

source: Installation Preparations
fi: Asennuksenvalmistelut

source: Preparing to Install
fi: Valmistautuuasentamaan

source: Ubuntu Budgie is relatively simple to set up, whether you're looking to replace your existing operating system or install Ubuntu Budgie alongside an existing one - such as &nbsp;<span class="fa fa-windows"></span> Microsoft Windows or another <span class="fa fa-linux"></span> GNU/Linux distribution.
fi: Ubuntu Budgie on suhteellisen helppo asentaa, halusitpa sitten korvata nykyisen käyttöjärjestelmäsi tai asentaa Ubuntu Budgien olemassa olevan käyttöjärjestelmän rinnalle - kuten &nbsp;<span class="fa fa fa-windows"></span> Microsoft Windowsin tai jonkin muun <span class="fa fa-linux"></span> GNU/Linux-jakelun.

source: For the best results:
fi: Saavuttaaksesiparhaattulokset:

source: <u><b>Back up</b></u> any important data to another storage device.
fi: <u><b>Varmuuskopioi</b></u>kaikkitärkeättiedostosierillisellekovalevylle.

source: Connect to the Internet to install all available updates during installation.
fi: YhdistäInternet:iinjottakaikkitarjollaolevatpäivityksetasennettaisiinjoasennuksenaikana.

source: Stay connected to the Internet to install all available updates.
fi: PysyyhdistettynäInternet:iinjottakaikkipäivityksetasennetaan.

source: Plug in your device to the mains if it is running on battery power.
fi: Kytkelaitteesipäävirtaanmikäliseonkäytössäakkuvirranvarassa.

source: The live session you are currently in right now is a good opportunity to test Ubuntu Budgie without modifying your computer, allowing you to test all of your peripherals are working as intended before committing to installing it on your machine. Once you are ready, double click the installation icon from the desktop.
fi: Live-istunto, jossa olet juuri nyt, on hyvä tilaisuus testata Ubuntu Budgiea muuttamatta tietokonettasi, jolloin voit testata, että kaikki oheislaitteet toimivat tarkoitetulla tavalla, ennen kuin sitoudut asentamaan sen koneellesi. Kun olet valmis, kaksoisnapsauta asennuskuvaketta työpöydältä.

source: Modern UEFI-based computers
fi: NykyaikaisetUEFI-pohjaisettietokoneet

source: If you have a modern PC that uses the Unified Extended Firmware Interface (UEFI), you may need to disable <b>Secure Boot</b> (or enable the <b>Unlock Bootloader</b> option) prior to installation, particularly if an operating system was pre-installed.
fi: MikälisinullaonnykyaikainenPCjokakäyttääUnifiedExtendedFirmwareInterface(UEFI)ratkaisua,voiollaettäsinunpitääkytkeäpois<b>SecureBoot</b>(taisittenkytkeäpäälle<b>UnlockBootloader</b>vaihtoehto)ennenasennusta,varsinkinjosjokinkäyttöjärjestelmäoliesiasennettu.

source: If you are using a legacy BIOS machine, you do not need to do this.
fi: MikälikäytössäsionvanhanaikainenBIOS-tietokone,tätäeitarvitsetehdä.

source: Especially when dual booting, it is important that you boot your system in the correct mode and use the <b> 64-bit image</b> , as you cannot boot an operating system installed in BIOS mode after installing a UEFI-enabled operating system or vice versa.
fi: Varsinkinjosaiotkaksoisbootata,kaksierikäyttöjärjestelmäätietokoneessa,ontärkeääettäkäynnistätjärjestelmäsioikeanlaatuisessatilassajakäytät<b>64-bittistälevykuvaa</b>,mikälikäyttöjärjestelmänkäynnistyseionnistuBIOS-tilassaasennettunaUEFI-käytölletarkoitetunkäyttöjärjestelmänjälkeentaipäinvastoin.

source: Booting in BIOS mode on a UEFI system with a GPT-formatted disk will also show a "protection layer". <b>Do not worry,</b> your data is not lost or corrupt!
fi: KäynnistysBIOS-tilassaUEFI-järjestelmässäGPT-alustetunlevynkanssanäyttääsemyös"suojauskerroksen".<b>Älähuoli,</b>tietosieivätolekadoksissataimenneetkäyttökelvottomaksi!

source: Your system is currently running in <b><span id="boot-mode"></span> mode</b>.
fi: Järjestelmääsiajetaantällähetkellämuodossa<b><spanid="boot-mode"></span>tilassa</b>.

source: Swap
fi: Heittovaihto-osioswap

source: For computers that start to run low on memory (RAM), the operating system will start swapping to disk. Known as a "paging file" in Windows. Performance will decrease when running low on memory and could possibly freeze if you completely run out of memory without anywhere to swap.
fi: Tietokoneissajoissakeskusmuisti(RAM)käyvähiin,käyttöjärjestelmäaloittaalevynswap-heittovaihtotiedostonkäytön.TämätunnetaanWindows:issa"sivutustiedostona".Suorituskykyheikkeneemuistinehtyessäjasenjohdostavoitapahtuajumiutuminen,mikälimuistiloppuukokonaanilmanmitäänheittovaihtotilaa.

source: By default, a swap file is created based on the size of your RAM. For example, if you have 2 GiB of RAM, then 2 GiB of hard disk space will be reserved for the swap file. A separate swap partition is no longer required to be created.
fi: Vakiollisesti,swap-heittovaihtotiedostoluodaanperustuenRAM-keskusmuistisimäärään.Esimerkiksi,jossinullaon2gigatavuakeskusmuistia,tätenlevyltävarataan2gigatavuatilaaswap-heittovaihtotiedostolle.Erillistäswap-heittovaihto-osionluomistaeienäävaadita.

source: Previous:
fi: Edellinen:

source: Should you wish to install Ubuntu Budgie alongside your existing operating system, your partitions need to be shrunk. This results in sections of your hard disk being split between multiple operating systems.
fi: Jos haluat asentaa Ubuntu Budgien nykyisen käyttöjärjestelmäsi rinnalle, osioita on pienennettävä. Tämä johtaa siihen, että kiintolevyn osia jaetaan useamman käyttöjärjestelmän kesken.

source: I'm dual booting with
fi: Haluankäyttääkaksoiskäynnistystänäidenkesken

source: To minimize the risk of data loss or failure, ensure that:
fi: Minimoidaksesitietojenmenetyksentairikkoutumisen,varmistaettä:

source: There is enough free space. 10 GB minimum is recommended.
fi: Vapaatalevytilaaontarpeeksi.Vähintään10Gtonsuositeltumäärä.

source: <b><u>Back up</u></b> important data to another drive.
fi: <b><u>Varmuuskopioi</u></b>tärkeättiedostottoisellelevylle.

source: Defragment the hard drive.
fi: Suoritakovalevyneheytys.

source: Ensure Windows has been cleanly shut down (not hibernated).
fi: VarmistaettäWindowsonpuhtaastisuljettu(eikäolehorrostilassa).

source: Which approach would you prefer?
fi: Mitälähestymistapaasuosisit?

source: Simple
fi: Yksinkertainen

source: Advanced
fi: Edistynyt

source: Safest
fi: Turvallisin

source: The simplest method is to use the installer.
fi: Yksinkertaisintapaonkäyttääasennusohjelmaa.

source: The installer scans your disks for existing operating systems and provides a choice on what you'd like to do.
fi: Asennusohjelmaläpikäylevysietsienjoolemassaoleviakäyttöjärjestelmiäsekätarjoaavalinnansillemitähaluattehdä.

source: You will see an option similar to this:
fi: Tuletnäkemääntämänkaltaisenvaihtoehdon:

source: Followed by:
fi: Jotaseuraa:

source: Do not interrupt or power off the computer during a resize operation.
fi: Äläkeskeytätietokonettataikytkesiitäpoisvirtaalevynuudelleenkoostamistoiminnonaikana.

source: If you do, data loss or a partition table corruption could occur. Please double check your changes before proceeding.
fi: Mikäliteetniin,voitapahtuatietojenmenetystaiosiotaulukonrikkoontuminen.Tarkistamuutoksesikahteenkinkertaanennenjatkamista.

source: The installer may show a <span class="fa fa-spinner"></span> spinner cursor for a long period of time, depending on the size of your disk.
fi: Asennusohjelmavoinäyttää<spanclass="fafa-spinner"></span>pyörivääosoitintapitkänkinaikaa,riippuenlevysikoosta.

source: <b>When you next boot Windows, run</b> <code>chkdsk /f</code> from the command prompt to check the file system for errors. Windows may schedule this automatically. This ensures consistency for the NTFS file system.
fi: <b>KunseuraavankerrankäynnistätWindows:iin,aja</b><code>chkdsk/f</code>komentokehotteestatarkistaaksesitiedostojärjestelmänvirheiltä.Windowssaattaatoimittaatämänautomaattisesti.TämävarmistaalevynjohdonmukaisuudenNTFS-tiedostojärjestelmäävarten.

source: Use GParted or the installer's "Custom" option.
fi: KäytäGParted-ohjelmaataiasennusohjelmanvaihtoehtoa"Mukautettu".

source: <b>GParted</b> is available during the live session only. It is located under the <b>System Tools <i class="material-icons">&#xE315;</i></b>menu. GParted provides complete flexibility over your partitions, primarily for power users who know how they'd like to layout their disks. This method makes changes to partitions prior to installation.
fi: <b>GParted</b>ontarjollavainlive-istunnonaikana.Sesijaitsee<b>Järjestelmätyökalut<iclass="material-icons">&#xE315;</i></b>valikonalla.Gpartedtarjoaakokonaisvaltaisenjoustavuudenosioidesisuhteen,ensisijaisestitehokäyttäjillejotkatietävätmitenhehaluavatlevynsäosioida.Tämämenetelmätekeeosiomuutoksetennenasennusta.

source: Open GParted
fi: AvaaGParted

source: After completing operations to your disk, you can leave the remaining space unallocated, whereby the installer will detect this unused space to install Ubuntu Budgie to.
fi: Kun olet suorittanut levylle tehtävät toimenpiteet, voit jättää jäljellä olevan tilan varaamatta, jolloin asennusohjelma havaitsee tämän käyttämättömän tilan ja asentaa Ubuntu Budgien sinne.

source: Using the Installer's "Custom" option.
fi: Käytetäänasennusohjelmanvaihtoehtoa"Mukautettu".

source: Instead or in addition to GParted, the <b>Custom</b> option during the installation wizard can also configure and resize your partitions as well as choose mount points. Dividing your disks can make it somewhat easier to re-install the operating system later if desired.
fi: Gparted:insijasta-taisenlisäksi,<b>Mukautettu</b>vaihtoehtoasennusohjelmavelhossamahdollistaamyösosioidenmuokkaamisenjaniidenkoonmuuttamisensekäliitoskohtienvalinnat.Levyjesijakaminensaaaikaanjokseenkinhelpommankäyttöjärjestelmänuudelleenasentamisenmyöhemminmikälinäinhalutaantehdä.

source: You can specify these mount points:
fi: Voitmäärittäänämäliitoskohdat:

source: The base for Ubuntu Budgie
fi: Ubuntu -budgien tukikohta

source: Bootloader and kernels
fi: Käynnistyslatainjaytimet

source: Your personal files and folders
fi: Henkilökohtaisettiedostosijakansiosi

source: Temporary files
fi: Väliaikaisettiedostot

source: Contains most of the applications <i> (binaries, documentation, libraries, etc)</i>
fi: Sisältääuseimmatsovellukset<i>(binääritiedostot,dokumentaatio,kirjastot,jne)</i>

source: Variable data <i>(such as system logs)</i>
fi: Jatkuvamuutoksinendata<i>(kutenjärjestelmäntoiminnanylöskirjaustiedostot)</i>

source: Data for System Services <i>(typically used for server configurations)</i>
fi: Järjestelmäpalvelu-data<i>(käytetäänluonteenomaisestipalvelinasetuksiin)</i>

source: Additional software unmanaged by the package manager
fi: Lisäohjelmistotjoitapaketinhallintaeihallinnoi

source: such as
fi: kuten

source: Creating separate partitions for all above mount points is not necessary. The commonly partitioned directories being <code>/</code>, <code>/home</code> and <code>/boot</code>. These mount points can also be set across different physical disks, for instance, if you'd like the OS <code>/</code> on an SSD, but your personal files <code>/home</code> on a mechanical hard drive.
fi: Erillistenosioidenluominenkaikilleylläolevilleliitospisteilleeiolevälttämätöntä.Yleisestiosioitujenhakemistojenollen<code>/</code>,<code>/homeja<code>/boot</code>.Nämäliitospisteetvoidaanmyösasettaaläpierifyysistenlevyjenkesken,esimerkiksi,mikälihaluatkäyttöjärjestelmän<code>/</code>SSD:lle,muttakuitenkinhenkilökohtaisettiedostosikohteeseen<code>/home</code>mekaanisellakovalevyllä.

source: Shrink your system disk within Windows.
fi: KutistajärjestelmälevysiWindows:insisällä.

source: Applies to Windows Vista and later.
fi: PäteeWindowsVistaanjasitämyöhempiin.

source: If you are using Windows XP or earlier, you will need to use the <b>Simple</b> or <b>Advanced</b> method to shrink your disk.
fi: MikälikäytössäsionWindowsXPtaiaiempi,sinuntäytyykäyttäämenetelmiä<b>Yksinkertainen</b>tai<b>Edistynyt</b>levysikutistuttamiseksi.

source: Newer versions of Windows provide a tool to shrink the NTFS volume from within Windows. This is a safer bet if it's essential that Windows still boots on your computer while experiencing Ubuntu Budgie.
fi: Uudemmat Windows -versiot tarjoavat työkalun NTFS -äänenvoimakkuuden kutistamiseksi Windowsista. Tämä on turvallisempi veto, jos on välttämätöntä, että Windows käynnistyy edelleen tietokoneellesi kokeessasi Ubuntu -budgieta.

source: Open <b>Disk Management</b> from the start menu.
fi: Avaa<b>Levynhallinta</b>käynnistävalikosta.

source: Right click your desired drive and choose <b>Shrink Partition</b> from the context menu.
fi: Napsautahiirenoikeanpuoleisellanapillahaluttuaasemaajavalitse<b>Kutistaosio</b>kyseisenaihepiirinvalikosta.

source: Enter the amount to shrink your system partition by.
fi: Syötämääresillekuinkapaljonjärjestelmäosiotakutistetaan.

source: Remember, Ubuntu Budgie needs at minimum 32 GB of disk space.
fi: Muista, että Ubuntu Budgie tarvitsee vähintään 32 Gt levytilaa.

source: Further Reading
fi: Lisäluettavaa

source: For further information on the best practices to modify partitions containing Windows, see the following <a onclick="cmd('link?https://help.ubuntu.com/community/HowtoResizeWindowsPartitions')"> help article</a> online.
fi: SaadaksesilisätietojaparhaistakäytännöistäWindows:insisältävienosioidenmuokkaamiseen,lueseuraava<aonclick="cmd('link?https://help.ubuntu.com/community/HowtoResizeWindowsPartitions')">apuopas</a>internetissä.

source: Repairing Boot Problems
fi: Käynnistysongelmienkorjaaminen

source: Linux distributions use a boot loader known as <code>grub</code>, which looks for and bootstraps the operating system. However, some operating systems (such as Windows) do not integrate with existing boot loaders and will overwrite them, with the potential to lose access to Ubuntu Budgie temporarily.
fi: Linux -jakaumat käyttävät käynnistyslatainta, joka tunnetaan nimellä <code> grub </code>, joka etsii ja käynnistää käyttöjärjestelmän. Jotkut käyttöjärjestelmät (kuten Windows) eivät kuitenkaan integroitu olemassa oleviin käynnistyskuormaimiin ja korvaavat ne, ja potentiaalia menettää pääsy Ubuntu -budgieen väliaikaisesti.

source: Fortunately, you can use the <b>Boot Repair</b> tool to repair common problems caused by other operating systems.
fi: Voitonneksikäyttäätyökalua<b>Käynnistyskorjain</b>korjataksesiyleisiäongelmiajoitamuutkäyttöjärjestelmätaiheuttavat.

source: Requires downloading a package.
fi: Vaatiipaketinlataamisen.

source: Please connect to the Internet to download and use this utility.
fi: YhdistäInternet:iinladataksesijaottaaksesitämäntyökalunkäyttöön.

source: Sorry, Welcome was unable to establish a connection.
fi: Pahoittelut,Welcomeeikyennytmuodostamaanyhteyttä.

source: Download Boot Repair
fi: LataaBootRepair-käynnistyskorjain

source: Open Boot-Repair
fi: AvaaBoot-Repair-käynnistyskorjain

source: Install Preparations
fi: Asennavalmistelut

source: An Internet connection is required to download and install updates.
fi: Internet-yhteysvaaditaanpäivitystenlataamiseenjaasentamiseen.

source: Software Updater
fi: Ohjelmistopäivitykset

source: Ubuntu Budgie periodically will check to see if new software and security updates are available for your computer. If you have just installed Ubuntu Budgie, you might want to do this now.
fi: Ubuntu Budgie tarkistaa säännöllisesti, onko tietokoneellesi saatavilla uusia ohjelmistoja ja tietoturvapäivityksiä. Jos olet juuri asentanut Ubuntu Budgie, kannattaa ehkä tehdä tämä nyt.

source: <b>Software Updater</b> can be found later in the menu <strong>System Tools</strong>
fi: <b> ohjelmistopäivitys </b> löytyy myöhemmin valikosta <strong> järjestelmätyökalut </strong>

source: Check for Updates
fi: Tarkistapäivitykset

source: Restricted Extras
fi: Rajoitetutlisät

source: <strong>Ubuntu</strong> (the base distribution of Ubuntu Budgie) strives to make all of the most important software available to its users automatically. However patent and copyright restrictions (see Ubuntu License Policy) complicate distribution of software to support non-free formats.
fi: <strong> ubuntu </strong> (Ubuntun budgien perusjakauma) pyrkii tekemään kaikki tärkeimmät ohjelmistot käyttäjiensä automaattisesti. Patentti- ja tekijänoikeusrajoitukset (ks. Ubuntu-lisenssipolitiikka) kuitenkin monimutkaistaa ohjelmistojen jakelua ei-vapaiden muotojen tukemiseksi.

source: However, you can install the ability to play popular non-free media formats, including DVD, MP3, Quicktime, and Windows Media formats, by following the instructions below.
fi: Kaikkitarvittavavoidaankuitenkinasentaa,jottasuosittujaei-vapaitamediamuotojakutenDVD,MP3,Quicktime,jaWindowsMediakyetääntoistamaan,kunseuraatallaoleviaohjeita.

source: Ubuntu’s commitment to only include completely free software by default means that proprietary media formats are not configured “out of the box”. See Ubuntu’s Free Software Philosophy and the Free Formats page for a more comprehensive discussion of these issues.
fi: Ubuntuonvakiollisestisitoutunutsisällyttämäänvaintäysinvapaatohjelmistot,jokatarkoittaaettäomisteisiamediamuotojaeioleasetettutoimimaan“suoraltakädeltä”.LueUbuntu:nvapaidenohjelmistojenfilosofia-Ubuntu’sFreeSoftwarePhilosophy-ja-FreeFormats-elivapaatformaatit-sivututustuaksesikattavampaankeskusteluunnäistäaiheista.

source: <strong>Legal Notice</strong> Patent and copyright laws operate differently depending on which country you are in. Please obtain legal advice if you are unsure whether a particular patent or restriction applies to a media format you wish to use in your country.
fi: <strong>Lainopillisethuomautukset</strong>Patentti-jatekijänoikeuslaittoimivateritavallariippuenmissämaassaolet.Hankithanlainopillisianeuvojamikälioletepävarmajonkintietynpatentin-tairajoitteenlaillisistakäytännöistäliittyenhaluamasimediamuodonkäyttöönmaassasi.

source: Applying Changes...
fi: Muutoksiatoteutetaan...

source: Install
fi: Asenna

source: Remove
fi: Poista

source: Next:
fi: Seuraava:

source: While a wide range of hardware is compatible with Ubuntu Budgie , there are some components and peripherals that require proprietary drivers to function properly. Installing the firmware package is often required to get some devices, typically Bluetooth and Wi-Fi, to work correctly.
fi: Vaikka laaja valikoima laitteistoa on yhteensopiva Ubuntu -budgien kanssa, on joitain komponentteja ja oheislaitteita, jotka edellyttävät omistusoikeuden kuljettajia toimimaan kunnolla. Laiteohjelmistopaketin asentaminen tarvitaan usein laitteiden, tyypillisesti Bluetoothin ja Wi-Fi: n, saamiseksi oikein.

source: An Internet connection is required to download and install drivers.
fi: Internet-yhteysvaaditaanajureidenlataamistajaasennustavarten.

source: Additional Drivers
fi: Lisäajurit

source: <b>Additional Drivers</b> can be found later in <b>System Tools</b>
fi: <b> Lisäohjaimia </b> löytyy myöhemmin <b> järjestelmätyökaluista </b>

source: Graphics
fi: Grafiikat

source: Sorry, Welcome was unable to automatically identify the graphics vendor on this system.
fi: Pahoittelut,Tervetuloa-ohjelmaeikyennyttunnistamaantämänjärjestelmängrafiikkojakäsittelevännäytönohjaimenvalmistajaaautomaattisesti.

source: Card/Chipset:
fi: Kortti/sirusarja:

source: Unknown
fi: Tuntematon

source: NVIDIA Graphics Card Detected.
fi: NVIDIA-näytönohjainhavaittu.

source: NVIDIA may have drivers for your card that can boost performance for 3D applications and games as well as deliver improvements to power management.
fi: NVIDIA:llavoiollakortillesiajuritjotkakiihdyttävätsuorituskykyä3D-sovelluksiajapelejävartenkutenmyöstarjoavatparannuksiavirranhallintaan.

source: AMD Graphics Card Detected.
fi: AMD-näytönohjainhavaittu.

source: AMD's drivers are no longer supported on Ubuntu. The open source drivers you are currently using will deliver the most stable performance out of your card.
fi: AMD:najuriteivätoleenäätuettunaUbuntu:ssa.Avoimenlähdekoodinajuritjotkaovattällähetkelläkäytössätarjoavatkaikkeinvakaimmansuorituskyvynnäytönohjainkortillesi.

source: You're already good to go.
fi: Kaikkionsinullejovalmiiksikunnossa.

source: Intel's drivers are open source and are maintained/updated in the kernel.
fi: Intel:inajuritovatlähdekoodiltaanavoimetjaylläpidetään/päivitetäänLinux-ytimessä.

source: VirtualBox Guest Additions
fi: VirtualBox-virtualisointiohjelmanGuestAdditions-vieraslisäykset

source: To accelerate graphics performance inside the virtual machine, please install Guest Additions.
fi: Kiihdyttääksesigrafiikankäsittelynsuorituskykyävirtuaalikoneensisällä,asennaGuestAdditions-vieraslisäykset.

source: Proprietary or Open Source Drivers?
fi: Omisteisetvaikoavoimenkoodinajurit?

source: Proprietary drivers come directly from the manufacturer. As they are not open source, Ubuntu developers are <b>unable to review and improve driver code</b> meaning you'll have to rely on the manufacturer for support.
fi: Omisteisetajuritsaapuvatsuoraanvalmistajalta.Koskaneeivätolekoodiltaanavoimia,Ubuntu-kehittäjätovat<b>estetyttarkastelemaanjaparantamaanajurikoodia</b>tarkoittaensitäettäsinuntäytyyluottaakäyttötuessavalmistajaan.

source: In addition, proprietary drivers can <b>significantly improve graphics performance</b> and as a result, the entire system. Users may wish to install these drivers to:
fi: Tähänlisäyksenä,omisteisetajuritvoivat<b>parantaamerkittävästigraafistasuorituskykyä</b>jatämänseurauksena,kokojärjestelmän.Käyttäjäthaluavatluultavastiasentaanämäajuritajaakseen:

source: Run 3D applications and games.
fi: 3D-sovelluksiajapelejä.
